# FabricationPartAlias Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartAlias Property
ParameterTypeId Class See Also
---
"Alias"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartAlias { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartAlias As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartAlias {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace